the best life story/03 War Bride Runs for Congress.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-12 Thu 16:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="WIN-JF56LDN0M2Q" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org8b9bd64" class="outline-2">
<h2 id="org8b9bd64">War Bride Runs for Congress</h2>
<div class="outline-text-2" id="text-org8b9bd64">
<p class="verse">
A college drop-out and war bride of World War II,<br />
&nbsp;&nbsp;I raised three successful children and had a groundbreaking career in politics with campaigns,<br />
&nbsp;&nbsp;&nbsp;&nbsp;White House visits, and Presidential appointments.<br />
At 62, I ran for Congress, the first woman in Virginia to be nominated by a major party.<br />
Served 16 years (4 terms) as one of Virginia’s two elected representatives<br />
&nbsp;&nbsp;on the Republican National Committee, serving on the Executive Committee.<br />
On first-name basis with Republican presidents from Gerald Ford forward.<br />
Served 10 years on the White House Commission for Presidential Scholars.<br />
Lost a close race for the state legislature but became valued aide to the majority leader.<br />
Along the way, I graduated from college at age 54, the same day as my youngest child.<br />
I was widowed at 82 and now, at 87, I have started Flo’s Bakery, LLC,<br />
&nbsp;&nbsp;to market mincemeat pie filling made from my greatgrandmother’s recipe.<br />
</p>
</div>
<div id="outline-container-org85f1337" class="outline-3">
<h3 id="org85f1337">expression</h3>
<div class="outline-text-3" id="text-org85f1337">
<p>
drop-out: n. 中途退学的人<br />
bride [braɪd]: n. a woman at the time she gets married or just after she is married ⇨ groom新娘<br />
groundbreaking [ˈɡraʊn(d)ˌbreɪkɪŋ]: adj. groundaking work involves making new discoveries, using new methods etc全新的<br />
campaign [kæmˈpeɪn]: n. a series of actions intended to achieve a particular result relating to politics or business, or a social improvement运动<br />
aide [eɪd] to sth./sb.: 辅助sth./sb.<br />
recipe [ˈresəpi]: n. a set of instructions for cooking a particular type of food配方<br />
</p>
</div>
</div>
<div id="outline-container-orgf5e07b7" class="outline-3">
<h3 id="orgf5e07b7">sentences</h3>
<div class="outline-text-3" id="text-orgf5e07b7">
<p>
drop-out: n. 中途退学的人<br />
</p>
<ul class="org-ul">
<li>As a college drop-out, I was treated unfair by my father in our family.<br /></li>
<li>Watch and learn, that so-called college drop-out runs his huge international business.<br /></li>
<li>Why would you let such a college drop-out work for our corporation?<br /></li>
</ul>
<p>
bride [braɪd]: n. a woman at the time she gets married or just after she is married ⇨ groom新娘<br />
</p>
<ul class="org-ul">
<li>She has been treated like an animal in the village because she was not a virgin as a bride-to-be.<br /></li>
<li>She looks amazing dressing up like a bride in the anniversary.<br /></li>
<li>No father would accuse a bride of her bad manners in her childhood.<br /></li>
</ul>
<p>
groundbreaking [ˈɡraʊn(d)ˌbreɪkɪŋ]: adj. groundbreaking work involves making new discoveries, using new methods etc全新的<br />
</p>
<ul class="org-ul">
<li>Our company is lack of energy, maybe we need to bring some new guys who are willing to do groundbreaking works.<br /></li>
<li>She got herself in trouble in this company in pursuit of groundbreaking works.<br /></li>
<li>The profit we have made last year is based on those groundbreaking rules our boss made.<br /></li>
</ul>
<p>
campaign [kæmˈpeɪn]: n. a series of actions intended to achieve a particular result relating to politics or business, or a social improvement运动<br />
</p>
<ul class="org-ul">
<li>A great number of young student who has just gone to university lost their control in this campaign.<br /></li>
<li>The campaign proved successful, for sexual harassments almost can't be found in our communities.<br /></li>
<li>He advocates for a campaign in which we protect our foods from mouses.<br /></li>
</ul>
<p>
aide [eɪd] to sth./sb.: 辅助sth./sb.<br />
</p>
<ul class="org-ul">
<li>She determined giving up her job aide to her child who has been taken a good care by her parents.<br /></li>
<li>I win a lot of praise aide to my direct manager.<br /></li>
<li>Aide to our boss, I work my butt up to finish this task before the meeting.<br /></li>
</ul>
<p>
recipe [ˈresəpi]: n. a set of instructions for cooking a particular type of food配方<br />
</p>
<ul class="org-ul">
<li>It's said that the recipe can be dated back to 1000 years ago.<br /></li>
<li>The recipe which becomes popular with young people proved poisonous in our experiment.<br /></li>
<li>He goes out of his way to keep the secret of the recipe which has already been published abroad.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
